app/controllers/passwords_controller.rb

  def create
    if user = User.find_by(email_address: params[:email_address])
---
SELECT "users".* FROM "users" WHERE "users"."email_address" = ? LIMIT ?  [["email_address", "[FILTERED]"], ["LIMIT", 1]]

  def update
    if @user.update(params.permit(:password, :password_confirmation))
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2026-04-20 14:12:24.243181"], ["id", 298486374]]