app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("created_at", "email_address", "password_digest", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["created_at", "2026-04-20 16:38:47.303897"], ["email_address", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["updated_at", "2026-04-20 16:38:47.303897"]]