app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email_address", "password_digest", "created_at", "updated_at") VALUES ('seba123@gmail.com', '$2a$12$vBmV36rb8eGYFmoUYFH9Yuo31y1c7rdKWpg9OHtRgDXYzWKfK08da', '2026-04-21 01:43:46.603605', '2026-04-21 01:43:46.603605') RETURNING "id"